requiredstring=  ${getText(fieldName)} is required.
app.title=\u0E23\u0E30\u0E1A\u0E1A\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32\u0E04\u0E07\u0E04\u0E25\u0E31\u0E07
ktm.version=1.0.0
ktm.version_1=${version}
hello.message = Struts is up and running...
page.login=\u0E25\u0E07\u0E0A\u0E37\u0E48\u0E2D\u0E40\u0E02\u0E49\u0E32\u0E2A\u0E39\u0E48\u0E23\u0E30\u0E1A\u0E1A
page.login.user=\u0E0A\u0E37\u0E48\u0E2D\u0E1C\u0E39\u0E49\u0E43\u0E0A\u0E49
page.login.password=\u0E23\u0E2B\u0E31\u0E2A\u0E1C\u0E48\u0E32\u0E19
page.login.submit=\u0E40\u0E02\u0E49\u0E32\u0E2A\u0E39\u0E48\u0E23\u0E30\u0E1A\u0E1A
nav.database=\u0E10\u0E32\u0E19\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25
nav.database.user=\u0E1C\u0E39\u0E49\u0E43\u0E0A\u0E49 (User)
nav.database.product=\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32
nav.database.group_product=\u0E01\u0E25\u0E38\u0E48\u0E21\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32
nav.database.supplier=supplier
nav.database.customer=\u0E25\u0E39\u0E01\u0E04\u0E49\u0E32
nav.database.substore=\u0E23\u0E16\u0E02\u0E32\u0E22\u0E2A\u0E48\u0E07
nav.file=\u0E41\u0E1F\u0E49\u0E21\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25
nav.file.setting=\u0E15\u0E31\u0E49\u0E07\u0E04\u0E48\u0E32\u0E23\u0E30\u0E1A\u0E1A
nav.edit=\u0E41\u0E01\u0E49\u0E44\u0E02
nav.edit.cancel_bill=\u0E22\u0E01\u0E40\u0E25\u0E34\u0E01\u0E1A\u0E34\u0E25
nav.edit.cancel_sold=\u0E02\u0E01\u0E40\u0E25\u0E34\u0E01\u0E01\u0E32\u0E23\u0E02\u0E32\u0E22
nav.transaction=\u0E40\u0E04\u0E25\u0E37\u0E48\u0E2D\u0E19\u0E44\u0E2B\u0E27
nav.transaction.receive_from_supplier=\u0E23\u0E31\u0E1A\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32\u0E08\u0E32\u0E01 Supplier
nav.transaction.return_to_supplier=\u0E04\u0E37\u0E19\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32\u0E43\u0E2B\u0E49 Supplier
nav.transaction.transfer=\u0E08\u0E48\u0E32\u0E22\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32\u0E43\u0E2B\u0E49\u0E23\u0E16\u0E02\u0E32\u0E22\u0E2A\u0E48\u0E07
nav.transaction.sale=\u0E01\u0E32\u0E23\u0E02\u0E32\u0E22\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32
nav.transaction.supplier_close_sale=\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E14\u0E01\u0E32\u0E23\u0E23\u0E31\u0E1A\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32\u0E08\u0E32\u0E01 Supplier
nav.transaction.supplier_close_return=\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E14\u0E01\u0E32\u0E23\u0E04\u0E37\u0E19\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32\u0E43\u0E2B\u0E49 Supplier
nav.transaction.substore_close=\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E14\u0E01\u0E32\u0E23\u0E08\u0E48\u0E32\u0E22\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32\u0E43\u0E2B\u0E49\u0E23\u0E16\u0E02\u0E32\u0E22\u0E2A\u0E48\u0E07
nav.transaction.substore_return_close=\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E14\u0E01\u0E32\u0E23\u0E04\u0E37\u0E19\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32\u0E08\u0E32\u0E01\u0E23\u0E16\u0E02\u0E32\u0E22\u0E2A\u0E48\u0E07\u0E40\u0E02\u0E49\u0E32\u0E04\u0E25\u0E31\u0E07\u0E01\u0E25\u0E32\u0E07
nav.transaction.close_sale=\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E14\u0E01\u0E32\u0E23\u0E02\u0E32\u0E22\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32
nav.other=\u0E2D\u0E23\u0E23\u0E16\u0E1B\u0E23\u0E30\u0E42\u0E22\u0E0A\u0E19\u0E4C
nav.other.user_authrized=\u0E01\u0E33\u0E2B\u0E19\u0E14\u0E02\u0E2D\u0E1A\u0E40\u0E02\u0E15\u0E43\u0E0A\u0E49\u0E07\u0E32\u0E19\u0E02\u0E2D\u0E07 User
nav.other.change_password=\u0E40\u0E1B\u0E25\u0E35\u0E22\u0E19\u0E23\u0E2B\u0E31\u0E2A\u0E1C\u0E48\u0E32\u0E19
nav.other.user_authentication=\u0E1C\u0E39\u0E49\u0E43\u0E0A\u0E49\u0E41\u0E25\u0E30\u0E23\u0E2B\u0E31\u0E2A\u0E1C\u0E48\u0E32\u0E19
nav.report=\u0E23\u0E32\u0E22\u0E07\u0E32\u0E19
nav.report.before_close=\u0E23\u0E32\u0E22\u0E07\u0E32\u0E19\u0E01\u0E48\u0E2D\u0E19\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E14
nav.report.store_balance=\u0E23\u0E32\u0E22\u0E07\u0E32\u0E19\u0E04\u0E07\u0E40\u0E2B\u0E25\u0E37\u0E2D
nav.report.all=\u0E23\u0E32\u0E22\u0E07\u0E32\u0E19\u0E10\u0E32\u0E19\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25
nav.report.after_close01=\u0E23\u0E32\u0E22\u0E07\u0E32\u0E19\u0E2B\u0E25\u0E31\u0E07\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E1401
nav.report.after_close02=\u0E23\u0E32\u0E22\u0E07\u0E32\u0E19\u0E2B\u0E25\u0E31\u0E07\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E1402
nav.report.after_close03=\u0E23\u0E32\u0E22\u0E07\u0E32\u0E19\u0E2B\u0E25\u0E31\u0E07\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E1403
nav.report.after_close04=\u0E23\u0E32\u0E22\u0E07\u0E32\u0E19\u0E2B\u0E25\u0E31\u0E07\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E1404
nav.report.after_close05=\u0E23\u0E32\u0E22\u0E07\u0E32\u0E19\u0E2B\u0E25\u0E31\u0E07\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E1405
nav.report.after_close06=\u0E23\u0E32\u0E22\u0E07\u0E32\u0E19\u0E2B\u0E25\u0E31\u0E07\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E1406
nav.report.after_close07=\u0E23\u0E32\u0E22\u0E07\u0E32\u0E19\u0E2B\u0E25\u0E31\u0E07\u0E01\u0E32\u0E23\u0E1B\u0E34\u0E14\u0E22\u0E2D\u0E1407
page.user_data=\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25 User
prename.mr=\u0E19\u0E32\u0E22
prename.miss=\u0E19\u0E32\u0E07\u0E2A\u0E32\u0E27
prename.mis=\u0E19\u0E32\u0E07
page.user_data.title=\u0E08\u0E31\u0E14\u0E01\u0E32\u0E23\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25\u0E1C\u0E39\u0E49\u0E43\u0E0A\u0E49
page.user_data.desc=\u0E41\u0E01\u0E49\u0E44\u0E02\u0E23\u0E32\u0E22\u0E25\u0E30\u0E40\u0E2D\u0E35\u0E22\u0E14\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25\u0E1C\u0E39\u0E49\u0E43\u0E0A\u0E49
page.btn.add=\u0E40\u0E1E\u0E34\u0E48\u0E21
page.btn.edit=\u0E41\u0E01\u0E49\u0E44\u0E02
page.btn.search=\u0E04\u0E49\u0E19\u0E2B\u0E32
page.error.require_select_row=\u0E01\u0E23\u0E38\u0E13\u0E32\u0E40\u0E25\u0E37\u0E2D\u0E01\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23\u0E17\u0E35\u0E48\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23\u0E41\u0E01\u0E49\u0E44\u0E02
page.user_data.field.id=\u0E23\u0E2B\u0E31\u0E2A
page.user_authen=\u0E1C\u0E39\u0E49\u0E43\u0E0A\u0E49\u0E41\u0E25\u0E30\u0E23\u0E2B\u0E31\u0E2A\u0E1C\u0E48\u0E32\u0E19
page.user_authen.title=\u0E08\u0E31\u0E14\u0E01\u0E32\u0E23\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25\u0E23\u0E2B\u0E31\u0E2A\u0E1C\u0E48\u0E32\u0E19
page.user_authen.desc=\u0E40\u0E1B\u0E25\u0E35\u0E48\u0E22\u0E19\u0E41\u0E1B\u0E25\u0E07\u0E41\u0E01\u0E49\u0E44\u0E02\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25\u0E41\u0E2A\u0E14\u0E07\u0E15\u0E31\u0E27\u0E40\u0E02\u0E49\u0E32\u0E2A\u0E39\u0E48\u0E23\u0E30\u0E1A\u0E1A\u0E41\u0E25\u0E30\u0E23\u0E2B\u0E31\u0E2A\u0E1C\u0E48\u0E32\u0E19
page.product=\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32
page.product.title=\u0E08\u0E31\u0E14\u0E01\u0E32\u0E23\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32
page.product.desc=\u0E41\u0E01\u0E49\u0E44\u0E02\u0E40\u0E1B\u0E25\u0E35\u0E48\u0E22\u0E19\u0E41\u0E1B\u0E25\u0E07\u0E02\u0E49\u0E2D\u0E21\u0E39\u0E25\u0E1B\u0E23\u0E30\u0E40\u0E20\u0E17\u0E2A\u0E34\u0E19\u0E04\u0E49\u0E32
page.logout=\u0E2D\u0E2D\u0E01\u0E08\u0E32\u0E01\u0E23\u0E30\u0E1A\u0E1A
ERR_AUTH_LoadAuthenticatorException=ERR_AUTH_LoadAuthenticatorException
ERR_AUTH_InstantiateAuthenticatorException=ERR_AUTH_InstantiateAuthenticatorException

